Revit 2026 API

# IExternalResourceServerAreSameResources Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool AreSameResources(
	IDictionary<string, string> reference1,
	IDictionary<string, string> reference2
)
```
```vb
Function AreSameResources (
	reference1 As IDictionary(Of String, String),
	reference2 As IDictionary(Of String, String)
) As Boolean
```
```cpp
bool AreSameResources(
	IDictionary<String^, String^>^ reference1,
	IDictionary<String^, String^>^ reference2
)
```
```fsharp
abstract AreSameResources :
        reference1 : IDictionary<string, string> *
        reference2 : IDictionary<string, string> -> bool
```

#### Parameters

reference1 IDictionaryString, String

reference2 IDictionaryString, String

#### Return Value

Boolean

#### Reference

IExternalResourceServer Interface

Autodesk.Revit.DB Namespace